{
  "source_experiment": "/Users/ns/Desktop/projects/extracthero/filter_strategy_experiment_20250710_154903.json",
  "analysis_timestamp": "2025-07-10T16:41:34.204130",
  "total_analyses": 40,
  "successful_analyses": 40,
  "individual_results": [
    {
      "run_id": 1,
      "strategy": "liberal",
      "iteration": 1,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 1 | Iteration: 1\n\nRETAINING_TARGET_INFORMATION: 30/33  \n• Reverse-voltage data captured twice – headline “Reverse voltage: V₍R₎ ≤ 100 V” and table column “V₍R₎ [max] (V): 100”.  \n• Forward-voltage data captured – table column “V₍F₎ [max] (mV): 1000 @ IF = 50 mA”.  \n• Voltage figures appear exactly as on the source page, so numerical fidelity is intact.  \n• No other voltage-related columns (e.g., “breakdown voltage”, “surge voltage”) exist on the source, so nothing is missing.  \n• Minor shortfall: the context “≤” qualifier in the headline is kept, but units in the VF cell (“mV”) could be overlooked by a parser because of the annotation “@ IF=50 mA” that is not voltage-centric. Otherwise, coverage is complete.\n\nELIMINATING_NON_RELEVANT: 15/33  \n• Whole parametric table is retained, bringing in many non-voltage columns (current ratings, capacitance, package name, automotive flag, etc.).  \n• Surrounding HTML scaffolding (<div>, <thead>, tool-tips) remains.  \n• Only two out of thirteen table columns are voltage-related, so the signal-to-noise ratio is low (~15 % voltage).  \n• Minimal attempt at dropping packaging and mechanical data; thus filtering is weak on irrelevance elimination.\n\nPRESERVING_INPUT_DATA: 28/34  \n• Original ordering, HTML tags, and table structure are preserved inside a code fence – good for downstream parsing.  \n• Special characters (subscripts, “≤”, tool-tip spans) are intact, maintaining technical context.  \n• Minor issues: triple “---” separators are artificial; outer markdown code block may confuse strict HTML parsers. Otherwise formatting fidelity is high.\n\nTOTAL SCORE: 73/100\n\nKEY STRENGTHS:\n- Captures every voltage datum present (VR headline + VR and VF in table).\n- Keeps exact numerical values and units.\n- Maintains table structure, easing later location of voltage cells.\n\nKEY WEAKNESSES:  \n- Large amount of non-voltage material retained, lowering efficiency of subsequent parsing.  \n- Extra markdown/separator clutter could complicate simple HTML scrapers.  \n- No explicit pruning of current/capacitance/packaging columns.\n\nVERDICT: Adequate voltage coverage with good structural fidelity, but filtering is too liberal, leaving considerable irrelevant data in the output.",
      "success": true,
      "timestamp": "2025-07-10T16:26:27.008013"
    },
    {
      "run_id": 2,
      "strategy": "inclusive",
      "iteration": 1,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 2 | Iteration: 1\n\nRETAINING_TARGET_INFORMATION: 28/33  \nThe snippet contains all of the clearly marked voltage items that normally matter:  \n• Reverse-voltage headline line “Reverse voltage: V₍R₎ ≤ 100 V”  \n• Parametric-table entry “V₍R₎ [max] (V) … 100” (same value but captured from the table)  \n• Two forward-voltage rows “V₍F₎ [max] (mV) … 1000@IF=50 mA” and “… 1000@VR=75 V”  \n\nThus both VR and VF are present and linked to their numeric limits. The run also preserved the “@IF=50 mA” test condition that belongs to the VF spec.  \nPotential misses: if the original page had other voltage-related items such as surge reverse voltage, peak repetitive reverse voltage, or breakdown voltage, they are not here. Because we cannot confirm completeness, a small deduction is applied.\n\nELIMINATING_NON_RELEVANT: 30/33  \nAlmost everything kept is voltage-centric. The only extra data are the short test-condition tokens “@IF=50 mA” (current) and “@VR=75 V” (redundant VR reference). No packaging, temperature, power, or mechanical data appear. Noise is therefore minimal and signal-to-noise is high. A tiny deduction for the embedded current condition.\n\nPRESERVING_INPUT_DATA: 25/34  \nThe filter keeps the original HTML tags (<li>, <tr>, <th>, <td>) and relative ordering, which helps a downstream parser understand context. However:  \n• Outer table wrappers (<table>, <tbody>) have been dropped.  \n• “---” separators are injected and are not part of the source markup.  \n• The header cells and data cells are split by extra line breaks that slightly obscure the 1-to-1 relationship.  \n• Some inline context (e.g., tooltip title text) is lost.  \nOverall the data remain readable and machine-parsable but with moderate structural degradation.\n\nTOTAL SCORE: 83/100\n\nKEY STRENGTHS:  \n- Captures both reverse and forward voltage limits with numeric values.  \n- Very little non-voltage noise; high precision.  \n- Maintains enough HTML context for most parsers to map headers to values.\n\nKEY WEAKNESSES:  \n- Possible omission of other voltage parameters (surge, peak, breakdown, etc.).  \n- Table structure partially collapsed; custom “---” dividers could confuse strict HTML parsers.  \n- Minor contamination with a current spec inside a voltage line.\n\nVERDICT: Solid filter output that retains the essential voltage information with minimal noise, though some structural fidelity and potential additional voltage specs could be improved.",
      "success": true,
      "timestamp": "2025-07-10T16:27:01.716927"
    },
    {
      "run_id": 3,
      "strategy": "contextual",
      "iteration": 1,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 3 | Iteration: 1\n\nRETAINING_TARGET_INFORMATION: 29/33  \nThe filter kept every explicit voltage datum that appears in the source:  \n• Reverse voltage in the feature list: “V₍R₎ ≤ 100 V”.  \n• Table column “V₍R₎ [max] (V)” with value 100.  \n• Table column “V₍F₎ [max] (mV)” with value “1000 @ IF = 50 mA” (forward voltage and its test condition).  \nNo other voltage-related fields exist in the snippet, so nothing is missing. Minor point deductions because the test condition for V₍F₎ is partly current information and might need clearer separation.\n\nELIMINATING_NON_RELEVANT: 14/33  \nMost non-voltage material was left untouched: switching speed, capacitance, leakage current, package data, soldering profiles, packing PDFs, currents (IF, IFSM, IFRM), t_rr, etc. Voltage information represents only a small fraction of the retained text, so the signal-to-noise ratio is weak. Slight credit because the run did not add extra noise—everything shown does exist in the source—but it hardly filtered anything.\n\nPRESERVING_INPUT_DATA: 31/34  \nThe original hierarchy (headings, bullet list, multi-column tables, hyperlinks) is almost perfectly preserved, maintaining context and parameter relationships. Minor markdown quirks (unbalanced `<td>` tags in the second table) cost a few points but overall the structure is intact and readable.\n\nTOTAL SCORE: 74/100\n\nKEY STRENGTHS:\n- Captured all voltage figures (VR and VF) that were present.\n- Maintained table context so each voltage value is tied to its product row.\n- Preserved nearly the entire original formatting for easy downstream parsing.\n\nKEY WEAKNESSES:  \n- Did very little filtering; lots of non-voltage parameters and packaging data remain.\n- Forward-voltage line still bundled with current test condition, which may complicate dedicated voltage parsing.\n- Minor HTML/markdown inconsistencies that could trip strict parsers.\n\nVERDICT: Accurate on voltage capture but poor at removing irrelevant information; structurally sound yet overly inclusive.",
      "success": true,
      "timestamp": "2025-07-10T16:27:18.483306"
    },
    {
      "run_id": 4,
      "strategy": "recall",
      "iteration": 1,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 4 | Iteration: 1\n\nRETAINING_TARGET_INFORMATION: 12/33  \n• Captured reverse-voltage information (VR ≤ 100 V) in four separate places, including a parametric-table line – good.  \n• Forward-voltage (VF) data is completely absent; no VF at any current point is provided.  \n• No other voltage-rated parameters (e.g., peak repetitive reverse voltage, breakdown voltage, transient voltage) are present.  \n• Only a single numeric value (100 V) is retained; the remaining mentions are textual repetitions.  \n• Therefore roughly one-third of the expected voltage signal is present.\n\nELIMINATING_NON_RELEVANT: 28/33  \n• Output is short (≈205 tokens) and tightly focused on voltage.  \n• Very little non-voltage material; “Low leakage current” and a brief “ordering & availability” reference are the only extras.  \n• No package, current, temperature, or marketing prose included.  \n• Excellent signal-to-noise ratio, minor deductions for the two non-voltage lines.\n\nPRESERVING_INPUT_DATA: 24/34  \n• Section labels and “---” separators preserve a sense of original structure, and parametric-table context is indicated.  \n• However, actual table formatting is flattened; only one row shown, so relational context (multiple columns/rows) is lost.  \n• HTML/Markdown subscripts converted to pseudo-markup (V<sub>R</sub>) but still intelligible.  \n• Overall coherent and organized, but fidelity to original technical layout is partial.\n\nTOTAL SCORE: 64/100\n\nKEY STRENGTHS:\n- Very concise, voltage-focused extract with minimal noise.\n- Multiple contextual confirmations of the same VR value increase confidence.\n- Readable organization with clear section headers.\n\nKEY WEAKNESSES:  \n- Omits all forward-voltage (VF) information and any additional voltage ratings; major retention gap.\n- Only a single parametric-table entry kept; relational data largely lost.\n- Minor non-voltage lines still present.\n\nVERDICT: Good noise reduction but inadequate coverage—forward-voltage and other critical voltage specs are missing, yielding only moderate overall performance.",
      "success": true,
      "timestamp": "2025-07-10T16:27:36.512977"
    },
    {
      "run_id": 5,
      "strategy": "liberal",
      "iteration": 2,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 5 | Iteration: 2\n\nRETAINING_TARGET_INFORMATION: 15/33  \n- Reverse-voltage data is partially present: the header “V R [max] (V)” is retained and one table cell shows “1000@VR=75V”.  \n- No explicit forward-voltage (V F) information was captured; nothing labelled V F or “Forward voltage” appears.  \n- No other voltage-related parameters (breakdown voltage, surge voltage, etc.) are included.  \n- Because one of the two critical voltage specs (V F) is missing and the remaining voltage context is fragmentary, more than half of the voltage signal is lost.\n\nELIMINATING_NON_RELEVANT: 14/33  \n- Large blocks of navigation (“Switching diodes”, category links), marketing text (“High-speed switching”, “Reverse polarity protection”), and package / current / mechanical data (SOT23, I FSM, bullet features) are kept.  \n- Only ~1–2 lines of the retained content are voltage-related; the majority is unrelated noise.  \n- Signal-to-noise ratio is therefore poor.\n\nPRESERVING_INPUT_DATA: 23/34  \n- Original HTML fragments are preserved with tags and table rows, maintaining some context for the remaining parameters.  \n- However, some rows are incomplete or duplicated (“<td><td>”) and ordering of cells is unclear, which can confuse downstream parsing.  \n- Despite extra noise, the voltage value does remain within its table context, so relationships are mostly intact.\n\nTOTAL SCORE: 52/100\n\nKEY STRENGTHS:\n- Reverse-voltage header and one value successfully retained.\n- Basic HTML/table context preserved, giving parsers a chance to locate the voltage cell.\n\nKEY WEAKNESSES:  \n- Forward-voltage information completely missing.  \n- Significant non-voltage content kept, lowering precision.  \n- Some malformed or duplicated tags that disturb structure.\n\nVERDICT: The liberal filter captured a fragment of the reverse-voltage spec but missed forward-voltage data and let substantial non-relevant material through, yielding mediocre extraction quality.",
      "success": true,
      "timestamp": "2025-07-10T16:27:58.000800"
    },
    {
      "run_id": 6,
      "strategy": "inclusive",
      "iteration": 2,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 6 | Iteration: 2\n\nRETAINING_TARGET_INFORMATION: 18/33  \n- Captured reverse-voltage spec twice:  \n  • “Reverse voltage: V₍R₎ ≤ 100 V” (list item)  \n  • Same value repeated in “Features and benefits”.  \n- Table fragment contains the number “100” in the 5th <td>; context implies it is the VR-max column, so the maximum reverse voltage rating (100 V) is also preserved.  \n- The string “1000@VR=75V” keeps an additional voltage reference (75 V) that may be useful.  \n- HOWEVER, no forward-voltage (V₍F₎) information appears. Typical/maximum VF figures that exist on most BAV99 datasheets (≈0.715 V, ≈1 V) are missing.  \n- Other voltage-related parameters (e.g., peak repetitive reverse voltage, surge voltage, breakdown voltage if any) are absent.  \n=> Roughly half of the desired voltage spectrum is missing, hence a substantial deduction.\n\nELIMINATING_NON_RELEVANT: 15/33  \n- Large amount of unrelated data retained: package code (SOT23), dimensions, switching speed, capacitance, leakage current, diode configuration, part numbers, and assorted numeric cells (“4”, “215”, “dual series”, “N”, etc.).  \n- Only ~4–5 tokens out of ~60 are voltage specific; signal-to-noise ratio is poor.  \n- No attempt to drop whole “Features and benefits” items that are not voltage-centric.  \n- Some noise is inevitable with an “inclusive” strategy, but this sample contains considerably more non-voltage material than necessary.\n\nPRESERVING_INPUT_DATA: 25/34  \n- Basic HTML fragments, list structure, and table cell ordering are kept, allowing a downstream parser to map values back to context.  \n- Row boundaries are replaced by “---”, which is acceptable but loses explicit header relationships; no column headers are present, so the meaning of each cell is ambiguous.  \n- Minor formatting corruption (e.g., stripped closing tags in table row) but overall coherence is decent and information is readable.  \n- Relationships between the “100” value and its “reverse voltage” meaning are inferable only by position, not explicit labeling—partial context loss.\n\nTOTAL SCORE: 58/100\n\nKEY STRENGTHS:\n- Successfully captured the main reverse-voltage rating (100 V) in two locations.\n- Maintained enough HTML/markup that a parser could still navigate the fragments.\n- Included one additional embedded voltage value (75 V) that might be useful.\n\nKEY WEAKNESSES:  \n- Forward-voltage specifications completely missing.  \n- High proportion of unrelated specifications and marketing text retained, lowering precision.  \n- Table context (headers) stripped, making voltage numbers harder to interpret.  \n- Duplicate reverse-voltage lines provide no extra value but add noise.\n\nVERDICT: While the filter preserves the primary reverse-voltage rating, it misses forward-voltage data and carries significant non-voltage clutter, yielding only moderate extraction quality.",
      "success": true,
      "timestamp": "2025-07-10T16:28:22.116847"
    },
    {
      "run_id": 7,
      "strategy": "contextual",
      "iteration": 2,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 7 | Iteration: 2\n\nRETAINING_TARGET_INFORMATION: 28/33  \n- Reverse voltage is present twice: in the feature list (“Reverse voltage: VR ≤ 100 V”) and in the parametric table column “V​R [max] (V) – 100”.  \n- Forward voltage is present in the parametric table as “V​F [max] – 1000 mV @ IF = 50 mA”.  \n- The only other voltage-related figure in the table is the parametric “Size (mm)” which is not voltage (ignored) – so no missed voltage fields within the supplied HTML.  \n- Relationship between voltage values and the part number (BAV99) is intact inside the row.  \n- No additional voltage parameters (e.g., surge voltage, breakdown voltage at temperature) appear in the original snippet, so nothing is missing.  \n- Minor deduction because the filter did not explicitly preserve the VR column header annotation “[max] (V)” next to the value outside the table context (only within the table), but still understandable.\n\nELIMINATING_NON_RELEVANT: 12/33  \n- Large amounts of non-voltage information remain: current ratings (IFSM, IR, IFRM, IF), capacitance, reverse-recovery time, package names, ordering codes, RoHS graphics, soldering documents, environmental indicators, etc.  \n- Entire “Package”, “Environmental information”, and “Series” sections are kept although none contain voltage data.  \n- Signal-to-noise ratio is therefore low; less than ~25 % of the retained tokens are voltage-related.  \n- Small credit for having removed page-level boilerplate (no navigation bars, cookie banners, etc.).\n\nPRESERVING_INPUT_DATA: 27/34  \n- Original hierarchy (features, parametrics table, package table, environmental table) is preserved with HTML tags; rows and columns remain readable.  \n- Voltage entries are shown in their original context (within the table row for BAV99).  \n- Minor structural glitches: second row of the package table is malformed (missing opening <tr>), and the closing tags are inconsistent, but readability for a downstream parser remains mostly intact.  \n- Overall coherence is good; headings and table borders are intact enough for downstream parsing.\n\nTOTAL SCORE: 67/100\n\nKEY STRENGTHS:\n- Captured both VR and VF values with their numeric limits and conditions.\n- Maintained clear association between voltage specs and the part number.\n- Kept table context that will help a parser understand each parameter.\n\nKEY WEAKNESSES:  \n- Retained large blocks of unrelated data (current, package, environmental, packing).\n- Signal-to-noise ratio is poor; voltage data is buried among many non-voltage fields.\n- Minor HTML/structure corruption could complicate strict parsers.\n\nVERDICT: Good at keeping the needed voltage figures, but filtering is too broad—significant irrelevant content remains, lowering efficiency of subsequent extraction steps.",
      "success": true,
      "timestamp": "2025-07-10T16:28:43.019558"
    },
    {
      "run_id": 8,
      "strategy": "recall",
      "iteration": 2,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 8 | Iteration: 2\n\nRETAINING_TARGET_INFORMATION: 26/33  \nThe snippet keeps the two explicit voltage columns that appear in the parametric table:  \n• Reverse-voltage V_R-max = 100 V  \n• Forward-voltage V_F-max = 1000 mV @ I_F = 50 mA  \nColumn headings that carry the voltage context (V_R and V_F) are also preserved, so a downstream parser can reliably recognise them.  \nHowever, if the original page contained any additional voltage limits (e.g. repetitive peak reverse voltage, working peak voltage, ESD ratings, surge voltage, supply voltage for logic etc.), they were not retained. Because the filter kept only one table, it is impossible to know whether other voltage information existed elsewhere on the page, which suggests potential loss. Hence a partial deduction.\n\nELIMINATING_NON_RELEVANT: 12/33  \nThe goal was “all information about voltage”. The output still contains:  \n• Package version and name, mechanical size, configuration info  \n• Five current-related parameters (I_FSM, I_R, I_FRM, I_F-max)  \n• Capacitance C_d, recovery time t_rr, automotive qualification flag  \n• Full HTML boiler-plate (divs, classes, table attributes)  \nOnly two out of fourteen data cells are voltage related, so the signal-to-noise ratio is poor. Little or no effort was made to strip non-voltage content, leading to a large penalty.\n\nPRESERVING_INPUT_DATA: 28/34  \nStructure is almost identical to the source: the table, headers, tool-tips and row order are intact. Relationships between headings and values are clear, aiding a parser. Minor issues: HTML comments are kept, but that does not break structure; outer page sections beyond this table may be missing. Overall preservation is high.\n\nTOTAL SCORE: 66/100\n\nKEY STRENGTHS:\n- Both reverse and forward voltage specs are present with their column headers.\n- Original tabular structure preserved, making parsing straightforward.\n- Voltage values remain in proper context (units, test conditions).\n\nKEY WEAKNESSES:  \n- Large amount of non-voltage information retained, lowering precision.  \n- Possible omission of other voltage specifications elsewhere on the page.  \n- No normalization (e.g., redundant HTML clutter) which inflates token count.\n\nVERDICT: Captures the essential V_R and V_F data but with a lot of extra baggage and a risk of missing additional voltage-related pieces—good recall, weak precision.",
      "success": true,
      "timestamp": "2025-07-10T16:29:07.938750"
    },
    {
      "run_id": 9,
      "strategy": "liberal",
      "iteration": 3,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 9 | Iteration: 3\n\nRETAINING_TARGET_INFORMATION: 29/33  \nThe filter successfully kept every explicit voltage-related datum that appeared in the supplied fragment.  \n• Stand-alone statement “Reverse voltage: V₍R₎ ≤ 100 V” was preserved.  \n• The first mini-table containing the single column “V₍R₎ [max] (V)” with the value 100 was kept.  \n• In the large parametric table, both voltage columns were retained – “V₍R₎ [max] (V)” (100 V) and “V₍F₎ [max] (mV)” (1000 mV @ IF=50 mA).  \nBecause no other voltage parameters (e.g., surge reverse voltage, breakdown voltage, transient voltage) existed in the source snippet, nothing appears to be missing. Minor deduction for not isolating the voltage cells from the rest of the row makes later parsing slightly harder.\n\nELIMINATING_NON_RELEVANT: 13/33  \nA great deal of non-voltage material remains:  \n• Current (I_FSM, I_R, I_FRM, I_F), recovery time (t_rr), capacitance (C_d), automotive-qualification flag, device type number.  \n• Entire HTML scaffolding (<div>, <tr>, class attributes, etc.) is still present.  \n• Only 2 of 10 parametric cells are voltage-related, giving a poor signal-to-noise ratio.  \nOverall, the filter behaved “liberally,” passing most of the page rather than focusing on voltage information.\n\nPRESERVING_INPUT_DATA: 31/34  \n• Original ordering, hierarchical sections (“Parametrics”, tables) and HTML tags are intact, so contextual relationships between parameters are clear.  \n• Delimiter lines (---) clearly separate major blocks.  \n• Minor formatting quirks (nested <p><p>) but nothing that breaks structure.  \n• No truncation or corruption observed.  \n\nTOTAL SCORE: 73/100\n\nKEY STRENGTHS:\n- Captured every voltage specification present (VR headline, VR table, VR & VF in parametric table).\n- Maintained full structural context, making it easy for downstream parsers to locate data.\n- No content loss or formatting corruption.\n\nKEY WEAKNESSES:  \n- Passed through a large amount of non-voltage information, harming precision.  \n- Did not attempt to minimise HTML noise or remove unrelated electrical parameters.  \n- Slight redundancy (duplicate VR=100 V in text and two tables) could complicate aggregation.\n\nVERDICT: Adequate for recall-focused tasks—voltage data are all there—but filtering is too permissive, leaving considerable irrelevant material that would need cleanup downstream.",
      "success": true,
      "timestamp": "2025-07-10T16:29:55.590787"
    },
    {
      "run_id": 10,
      "strategy": "inclusive",
      "iteration": 3,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 10 | Iteration: 3\n\nRETAINING_TARGET_INFORMATION: 28/33  \n• Reverse-voltage data captured twice: “Reverse voltage: V₍R₎ ≤ 100 V” in the list item and again as the numeric entry “100” in the VR column of the table.  \n• Forward-voltage data captured: “V₍F₎ [max] (mV) … 1000@IF=50 mA”.  \n• Voltage parameters embedded in the big product row are also present (100 V, 1000 mV@50 mA, 1000 nA@75 V).  \n• No other voltage-related headings appear to be missing from the snippet provided, so essential voltage information seems intact.  \n• Possible minor loss: If the original page contained additional voltage ratings (surge, peak repetitive, breakdown at different currents, etc.) they are not visible here; can’t prove they were lost, but the filter did not show any.  \n\nELIMINATING_NON_RELEVANT: 18/33  \n• Considerable non-voltage material remains:  \n  – Current specs (I_R, I_FRM).  \n  – Package / size (“SOT23”, “2.9 × 1.3 × 1”).  \n  – Pin count, weight, diode configuration, “N”, etc.  \n• Separators (“---”) and repeated table header fragments add further noise.  \n• Roughly half the retained text is not voltage-related, giving a mediocre signal-to-noise ratio.  \n• Some irrelevant HTML scaffolding still present (<tr>, <td>, class names).  \n\nPRESERVING_INPUT_DATA: 29/34  \n• Original HTML hierarchy largely preserved: list item, table with thead/tbody, and full product row keep context and allow a downstream parser to map headers to cells.  \n• Voltage entries remain aligned with their headers (VR, VF).  \n• Use of “---” dividers is artificial but does not obscure structure.  \n• Minor formatting degradation: partial tables broken apart (headers separated from rows), repeated header duplication, and missing enclosing <table> tags for later fragments.  \n• Overall coherence still good enough for automated parsing.  \n\nTOTAL SCORE: 75/100  \n\nKEY STRENGTHS:  \n- Captured both reverse and forward voltage specifications and their numeric values.  \n- Maintained header–value relationships enabling reliable parsing.  \n- Preserved most of the original technical context.\n\nKEY WEAKNESSES:  \n- Significant amount of non-voltage information retained, reducing precision.  \n- Some structural fragmentation (duplicated headers, separator lines) introduces minor parsing overhead.  \n- Unclear whether additional voltage ratings (e.g., surge) were lost.\n\nVERDICT: Solid capture of voltage data, but the filter is only moderately selective; it keeps too much extraneous material and could streamline output without sacrificing target information.",
      "success": true,
      "timestamp": "2025-07-10T16:30:13.860550"
    },
    {
      "run_id": 11,
      "strategy": "contextual",
      "iteration": 3,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 11 | Iteration: 3\n\nRETAINING_TARGET_INFORMATION: 27/33  \nThe filtered snippet keeps every voltage-related element that appears in the source:  \n• Features list still shows “Reverse voltage: V₍R₎ ≤ 100 V”.  \n• Parametric table retains the “V₍R₎ [max] (V)” column (100 V) and the “V₍F₎ [max] (mV)” column (1000 mV @ 50 mA), so both reverse and forward voltages are captured.  \n• No other voltage fields exist in the original sample (no breakdown, surge or regulator voltages), so nothing is missing.  \nMinor issue: the forward-voltage cell includes the drive-current qualifier (“@ IF = 50 mA”); that is fine for context but may need later parsing. Overall, all available voltage data were preserved.\n\nELIMINATING_NON_RELEVANT: 12/33  \nLarge amounts of unrelated information remain:  \n• Full “Features” bullet list (switching speed, capacitance, leakage current, package size).  \n• Entire parametric table columns for currents, capacitance, configuration, speed, etc.  \n• Complete ordering / packing / availability table, which has no voltage information at all.  \n• HTML scaffolding and links add further noise.  \nAlthough voltage items are present, the signal-to-noise ratio is poor; only ~15–20 % of the kept text concerns voltage.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original markdown/HTML hierarchy (headings, lists, tables) is almost entirely intact.  \n• Relationships between parameters inside the tables are preserved, so downstream parsers can still understand that “100 V” belongs to “V₍R₎” for “BAV99”.  \n• Minor defects: extra closing tags for <nex-order-product> and a miss-typed “tooltopTrigger”, but these do not break readability.  \n• No truncation or re-ordering observed.\n\nTOTAL SCORE: 69/100\n\nKEY STRENGTHS:  \n- Captures both VR and VF and keeps them in context.  \n- Maintains table structure, aiding subsequent parsing.  \n- Formatting and ordering of data largely preserved.\n\nKEY WEAKNESSES:  \n- Includes large volumes of non-voltage content (current, packaging, ordering info).  \n- No selective pruning of irrelevant table columns.  \n- Minor HTML clutter remains.\n\nVERDICT: Adequate for retaining voltage data but the filter is overly permissive, resulting in low signal-to-noise and room for significant refinement.",
      "success": true,
      "timestamp": "2025-07-10T16:30:30.543996"
    },
    {
      "run_id": 12,
      "strategy": "recall",
      "iteration": 3,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 12 | Iteration: 3\n\nRETAINING_TARGET_INFORMATION: 26/33  \n• Reverse-voltage information (V<sub>R</sub> ≤ 100 V in both the parametric table and the features list) is present.  \n• Forward-voltage information (V<sub>F</sub> [max] = 1000 mV @ I<sub>F</sub>=50 mA) is present.  \n• The parametric table column heading “V<sub>R</sub> [max] (V)” is captured with its value (100 V).  \n• No other voltage-related columns appear in the source, so nothing obvious is missing; however, any page-level text that might discuss surge, repetitive peak-reverse, or breakdown voltages was not captured, so coverage is probably not 100 %.  \n• All captured voltage data remain paired with their numeric values and context.\n\nELIMINATING_NON_RELEVANT: 15/33  \n• The entire parametric row is included, bringing in non-voltage fields (current ratings, capacitance, t<sub>rr</sub>, package size, configuration, automotive flag).  \n• A full “Environmental information” table—completely unrelated to voltage—was retained.  \n• Packaging details and generic feature bullets unrelated to voltage were also kept.  \n• As a result, signal-to-noise ratio is modest; roughly half the extracted tokens describe non-voltage data.\n\nPRESERVING_INPUT_DATA: 28/34  \n• Original HTML hierarchy (headings, table tags, list tags) is mostly intact, keeping relational context between column headings and values.  \n• Numerical units and conditional qualifiers (“@ I<sub>F</sub>=50 mA”) are preserved.  \n• Some long blocks of missing closing tags were trimmed, but readability and structure remain sufficient for a downstream parser.  \n• Overall coherence is good, though the mix of unrelated sections makes the output feel a bit cluttered.\n\nTOTAL SCORE: 69/100\n\nKEY STRENGTHS:  \n- Captures both key voltage parameters (V<sub>R</sub> and V<sub>F</sub>) with correct units and limits.  \n- Maintains table structure, enabling easy mapping of headings to values.  \n- Retains helpful contextual bullet (“Reverse voltage ≤ 100 V”) reinforcing extracted numbers.\n\nKEY WEAKNESSES:  \n- Includes substantial non-voltage information (currents, environmental data, package details), lowering precision.  \n- Potentially misses other voltage ratings that might exist elsewhere on the page (e.g., repetitive peak reverse voltage, surge voltage).  \n- Output could be slimmer and more focused if the filter removed entire non-voltage columns/sections.\n\nVERDICT: A reasonably complete capture of voltage data, but excessive unrelated content keeps the filter from being truly targeted or efficient.",
      "success": true,
      "timestamp": "2025-07-10T16:30:52.795198"
    },
    {
      "run_id": 13,
      "strategy": "liberal",
      "iteration": 4,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 13 | Iteration: 4  \n\nRETAINING_TARGET_INFORMATION: 28/33  \nThe filter kept the main voltage-related items that appeared in the snippet:  \n• Reverse-voltage limits shown twice – “Reverse voltage: VR ≤ 100 V” and “Reverse voltage: VR [max] (V): 100”.  \n• A forward-voltage value – “VF [max] (mV): 1000 @ IF = 50 mA” (i.e. 1 V).  \n• An embedded VR value in the leakage-current line “IR [max] (nA): 1000 @ VR = 75 V”, which could be useful to the parser.  \n\nNo other voltage figures seem to have been present in the source fragment, so nothing obvious was lost. However, without the full page we cannot be certain all other voltage rows (e.g. “VRRM”, “Vclamp”, “Breakdown voltage”) were preserved; therefore a small deduction is applied.\n\nELIMINATING_NON_RELEVANT: 19/33  \nThe output still carries a noticeable amount of non-voltage material:  \n• Package description, speed spec (trr), “Low leakage current”.  \n• Two marketing/white-paper paragraphs about “interactive datasheets”, GaN FETs, and logic-level translators – clearly outside the diode’s voltage specs.  \n• Current specification (IR) is mostly noise for a pure voltage extractor.  \nAbout half the 323 tokens are not strictly about voltage, giving a middling signal-to-noise ratio.\n\nPRESERVING_INPUT_DATA: 27/34  \n• Original line order and the “---” block delimiters are largely intact, which helps downstream parsing.  \n• Parameter/context coupling is preserved (e.g., VF line still carries its test current, VR values stay inside the same rows).  \n• Minor formatting losses (HTML <p>, <sub> tags partially stripped) but nothing that hinders understanding.  \n• No values were altered. Overall structure coherence is good, though not perfect.\n\nTOTAL SCORE: 74/100  \n\nKEY STRENGTHS:  \n- Captured all visible VR and VF numbers with contextual qualifiers.  \n- Maintained block structure that mirrors the source, easing parsing.  \n- Did not modify or corrupt numeric data.\n\nKEY WEAKNESSES:  \n- Considerable non-voltage narrative and marketing text left in.  \n- Possible omission of other voltage ratings if they existed beyond the snippet.  \n- HTML tags partially stripped, small loss of fidelity.\n\nVERDICT: Solid but not clean; essential voltage specs are present, yet extra noise remains and there is slight risk that some voltage rows were missed.",
      "success": true,
      "timestamp": "2025-07-10T16:31:12.482038"
    },
    {
      "run_id": 14,
      "strategy": "inclusive",
      "iteration": 4,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 14 | Iteration: 4\n\nRETAINING_TARGET_INFORMATION: 18/33  \nThe filter kept the main reverse-voltage statement (“Reverse voltage: V₍R₎ ≤ 100 V”) and the table header/value pair “V₍R₎ [max] (V) / 100”.  \nHowever, no explicit forward-voltage (V₍F₎) value appears; the lone “4” in the long row is unlabeled and cannot be confidently interpreted as V₍F₎.  \nOther voltage-related cells that often occur for diodes (e.g., breakdown voltage @ I = nA, peak reverse voltage, surge voltages) are absent.  \nSo only one class of voltage data (reverse) is clearly retained; forward and other ratings are missing, yielding a partial capture.\n\nELIMINATING_NON_RELEVANT: 15/33  \nRoughly 50 % of the retained text is unrelated to voltage: package (“SOT23”), mechanical dimensions, current ratings (“1000@IF=50 mA”), diode configuration (“dual series”), quantities (“215”), polarity (“N”), etc.  \nWhile the strategy is called “inclusive”, the signal-to-noise ratio is low; the output is cluttered with non-voltage specs that a dedicated voltage extractor would have to ignore.  \nOnly minimal non-voltage pruning appears (HTML noise is still present).\n\nPRESERVING_INPUT_DATA: 20/34  \nSome original HTML hierarchy is kept (e.g., list item, table header), which helps context.  \nYet the structure is broken: `<tbody>` is opened but never closed, table rows/columns are mis-nested, and headers for the long parameter row are missing, so relationships between numbers and their meanings are partially lost.  \nStill, the raw values are intact and in roughly the same order as the source, giving moderate preservation.\n\nTOTAL SCORE: 53/100\n\nKEY STRENGTHS:\n- Captures a clear reverse-voltage rating in two separate places.\n- Keeps numerical context (the “100 V” limit is unmistakable).\n- Maintains enough HTML cues for a downstream parser to recover some context.\n\nKEY WEAKNESSES:  \n- Forward-voltage (V₍F₎) and other voltage parameters are missing.  \n- Output is noisy with many non-voltage fields (package, currents, counts).  \n- HTML/table structure is damaged, losing header associations and coherence.\n\nVERDICT: The filter extracted basic reverse-voltage data but missed forward-voltage information and carried along substantial irrelevant content, resulting in only moderate overall quality.",
      "success": true,
      "timestamp": "2025-07-10T16:31:36.680906"
    },
    {
      "run_id": 15,
      "strategy": "contextual",
      "iteration": 4,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 15 | Iteration: 4\n\nRETAINING_TARGET_INFORMATION: 29/33  \n• Reverse-voltage information appears twice:  \n  – Feature bullet: “Reverse voltage: V₍R₎ ≤ 100 V”  \n  – Parametric table column “V₍R₎ [max] (V)” with value “100”.  \n• Forward-voltage information is included: “V₍F₎ [max] (mV) – 1000 @ IF = 50 mA”.  \n• The only device listed (BAV99) retains its full voltage ratings.  \n• No voltage data are lost from the excerpt, but there are no derating or surge-voltage figures; if they existed elsewhere on the page the filter did not capture them.  \n• Overall, core voltage specs required for this product are present.\n\nELIMINATING_NON_RELEVANT: 14/33  \n• A large amount of non-voltage data remains: current ratings (IF, IFSM, IFRM), capacitance, t_rr, package codes, soldering documents, RoHS logos, environmental links, ordering codes, status, markings, etc.  \n• Two full non-voltage tables (Package Information, Environmental Information) are kept intact.  \n• Only the section heading “Voltage” might mislead one to expect a purer voltage subset, but ~65 % of the tokens are unrelated to voltage.  \n• Signal-to-noise ratio is therefore mediocre.\n\nPRESERVING_INPUT_DATA: 31/34  \n• Original markdown/HTML structure, tables, column headers and tool-tip text are preserved.  \n• Voltage values remain in their contextual columns alongside related electrical parameters, so relationships are clear.  \n• Minor trimming (e.g., some image URLs shortened) is acceptable; overall integrity is high.\n\nTOTAL SCORE: 74/100\n\nKEY STRENGTHS:  \n- Captured both VR and VF values with context.  \n- Maintained complete parametric table, ensuring voltage data are not separated from device ID.  \n- Good structural fidelity; easy for downstream parser to locate voltage fields.\n\nKEY WEAKNESSES:  \n- Large amount of extraneous information (currents, package, environmental, soldering) reduces precision.  \n- If the original page contained additional voltage limits (e.g., surge reverse voltage), they were not filtered in.  \n- No explicit highlighting or summarisation of voltage data; raw dump may burden the parser.\n\nVERDICT: Solid at retaining voltage specifications and keeping structure, but needs much stronger pruning of non-voltage material to optimise downstream extraction.",
      "success": true,
      "timestamp": "2025-07-10T16:32:13.529969"
    },
    {
      "run_id": 16,
      "strategy": "recall",
      "iteration": 4,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 16 | Iteration: 4\n\nRETAINING_TARGET_INFORMATION: 15/33  \n• Captured: reverse-voltage spec (text statement “Reverse voltage: VR ≤ 100 V” twice) and the parametric-table value “VR [max] (V) 100”.  \n• Missed: any forward-voltage (VF) data – none appears in the kept content.  \n• Missed other voltage-related ratings that routinely exist on a full product page (e.g., peak reverse voltage, repetitive peak reverse voltage, transient voltage, ESD voltages, clamping voltages, etc.).  \n• No multi-temperature / test-condition context preserved (e.g., “VF @ IF = 1 mA”).  \n→ Only one voltage parameter family (reverse) retained; therefore a large penalty.\n\nELIMINATING_NON_RELEVANT: 20/33  \n• Non-voltage material still present:  \n  – Product-overview sentence about SOT-23 package.  \n  – A whole environmental/RoHS table and icon.  \n  – Section headings unrelated to voltage.  \n• However, outright current, power, switching-time, or mechanical dimensions were not kept, so noise is moderate, not excessive.  \n• Rough signal-to-noise estimate ≈ 60 % voltage vs 40 % other.\n\nPRESERVING_INPUT_DATA: 26/34  \n• Original section headings (“Product Overview”, “Parametrics”, etc.) and HTML snippets (table tags, list tags) retained, giving good traceability for a downstream parser.  \n• Parametric table row kept intact, so relationship between header “VR [max] (V)” and value “100” is preserved.  \n• Redundant duplication of the same spec appears, but structure is still coherent.  \n• Minor formatting artefacts (extra blank lines, repeated dashes) but nothing that hinders parsing.\n\nTOTAL SCORE: 61/100\n\nKEY STRENGTHS:\n- Successfully captures reverse-voltage values in both prose and tabular form.\n- Maintains table structure, making parsing straightforward.\n- Removes many totally unrelated spec categories (no currents, capacitances, etc.).\n\nKEY WEAKNESSES:  \n- Fails to include forward-voltage (VF) or any additional voltage parameters, so target information is incomplete.  \n- Includes some irrelevant text (package description, RoHS info), lowering precision.  \n- Some duplication; no context (test currents, temperatures) retained for voltage values.\n\nVERDICT: Adequate recall for reverse voltage but overall incomplete and somewhat noisy; needs improved filtering to capture all voltage parameters while dropping non-voltage content.",
      "success": true,
      "timestamp": "2025-07-10T16:32:29.604635"
    },
    {
      "run_id": 17,
      "strategy": "liberal",
      "iteration": 5,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 17 | Iteration: 5\n\nRETAINING_TARGET_INFORMATION: 28/33  \n- Reverse‐voltage data captured twice:  \n  • Text line “Reverse voltage: V₍R₎ ≤ 100 V”  \n  • Table column “V₍R₎ [max] (V)” with value 100  \n- Forward‐voltage data captured:  \n  • Table column “V₍F₎ [max] (mV)” with value “1000 @ IF=50 mA”  \n- No other voltage parameters (e.g., repetitive peak reverse voltage, surge voltage, ESD ratings) appear in the source excerpt, so nothing is missing from what was available.  \n- Context (device name and conditions) maintained inside the table.  \nMinor deductions: voltage value in the “Features and benefits” list duplicates VR but adds no new figure; no explicit extraction of any supply-voltage tolerances if they existed elsewhere on the page.\n\nELIMINATING_NON_RELEVANT: 17/33  \n- Large amount of unrelated material retained: package names, package size, t_rr, current ratings (I_FSM, I_FRM, I_F), capacitance, configuration, automotive qualification, applications, features about switching speed, etc.  \n- Only a small fraction of the table is voltage-related yet the entire row is kept.  \n- Some HTML decoration/tooltip markup also left in.  \n- Rough estimate: <25 % of the tokens concern voltage, so the signal-to-noise ratio is mediocre.\n\nPRESERVING_INPUT_DATA: 29/34  \n- Original sectional dividers (“---”), HTML tags, and full parametric table structure preserved, making the voltage values easy for a downstream parser to locate.  \n- Row/column associations between part number and its VR/VF are intact.  \n- Minor formatting noise (HTML tool-tip spans) but nothing that breaks structure.  \n- No truncation or corruption observed.\n\nTOTAL SCORE: 74/100\n\nKEY STRENGTHS:  \n- All available VR and VF figures were successfully captured.  \n- Parametric table retained with correct headers and cell alignment, preserving context.  \n- General document structure maintained.\n\nKEY WEAKNESSES:  \n- Considerable non-voltage information left in, lowering precision.  \n- Some redundant descriptive text and HTML artifacts could have been stripped.  \n- No attempt to isolate just the voltage columns from the table.\n\nVERDICT: Solid at retaining the needed voltage data but only mediocre at filtering out extraneous specifications, resulting in a good-but-noisy output.",
      "success": true,
      "timestamp": "2025-07-10T16:33:06.162854"
    },
    {
      "run_id": 18,
      "strategy": "inclusive",
      "iteration": 5,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 18 | Iteration: 5   \n\nRETAINING_TARGET_INFORMATION: 27/33  \n• Reverse voltage (VR) is explicitly captured twice: once in the bullet “Reverse voltage: V₍R₎ ≤ 100 V” and again in the Parametrics table column “V₍R₎ [max] (V) = 100”.  \n• Forward voltage (V₍F₎) is present in the same table (“V₍F₎ [max] = 1000 mV @ I₍F₎ = 50 mA”).  \n• These two items constitute the key voltage limits for this diode; no other voltage-rated parameters (e.g., VRRM, Vpeak, ESD, surge voltages) appear on the original page excerpt, so nothing obvious is missing.  \n• Context (type number row) is intact, so the parser can relate each voltage value to the correct device.  \n• Minor loss: the bullet uses “≤ 100 V” while the table uses “100”; if the original page contained additional conditions or temperature-dependent voltages they were not captured.  \n\nELIMINATING_NON_RELEVANT: 14/33  \n• Large amounts of non-voltage material remain: I_FSM, I_FRM, I_F, C_d, t_rr, package codes, soldering, packing, RoHS, RHF, chemical-content links, image tags, etc.  \n• Two full tables (“Package” and “Environmental information”) are entirely unrelated to voltage yet included in full.  \n• Overall signal-to-noise ratio is modest: roughly one voltage column out of 14 in the main table, plus the single bullet, versus hundreds of non-voltage tokens.  \n• No selective pruning was done; strategy is basically “pass almost everything that looks technical”.  \n\nPRESERVING_INPUT_DATA: 29/34  \n• Original HTML hierarchy (<p>, <ul>, <h3>, <table>, <thead>, <tbody>, <tr>, <td>) is maintained, so downstream scrapers can still navigate by tags.  \n• Table headers and units are preserved, keeping relationships clear (e.g., V_R column sits beside I_FSM, etc.).  \n• Minor blemishes: markdown separators (“---”) are injected where they did not exist; images are left as raw <img> links; otherwise fidelity is high.  \n• No obvious truncation or re-ordering detected.  \n\nTOTAL SCORE: 70/100  \n\nKEY STRENGTHS:  \n- Captured both reverse and forward voltage values with units.  \n- Maintained full parametric-table context, aiding association between part number and voltage data.  \n- High structural fidelity enables easy secondary parsing.  \n\nKEY WEAKNESSES:  \n- Very poor filtering; the majority of retained content is unrelated to voltage (package logistics, environmental icons, currents, capacitances, etc.).  \n- Potentially duplicative voltage info could confuse a simple parser (bullet vs. table).  \n- Slight formatting artifacts (“---”) and raw image links add noise.  \n\nVERDICT: Adequate at keeping the needed voltage specs but far too inclusive, resulting in mediocre overall efficiency for a voltage-only extractor.",
      "success": true,
      "timestamp": "2025-07-10T16:33:35.083321"
    },
    {
      "run_id": 19,
      "strategy": "contextual",
      "iteration": 5,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 19 | Iteration: 5\n\nRETAINING_TARGET_INFORMATION: 28/33  \nThe snippet retains every voltage-related datum that actually appears in the original fragment:  \n• Parametric table column “V<sub>R</sub> [max] (V)” with value 100 V.  \n• Parametric table column “V<sub>F</sub> [max] (mV)” with value 1000 mV @ I<sub>F</sub>=50 mA.  \n• Feature list bullet “Reverse voltage: V<sub>R</sub> ≤ 100 V”.  \nThus both reverse and forward voltage ratings are present and repeated in two contexts (table + bullet list).  \nPossible shortcomings: if the full product page contained other voltage items (e.g., peak reverse voltage, surge voltage, breakdown voltage for variants) they were not captured. Within the excerpt we see only one device row; if the page had multiple rows, those voltages are missing. Hence a small deduction.\n\nELIMINATING_NON_RELEVANT: 15/33  \nLarge amounts of non-voltage information remain:  \n• Entire HTML boilerplate (divs, classes, column tags).  \n• Complete parametric columns for current, capacitance, package, size, configuration, automotive qualification, etc.  \n• Full “Features and benefits” and “Applications” sections, most lines unrelated to voltage.  \n• Only a tiny portion (≈10-15 %) of the kept tokens are voltage data, so the signal-to-noise ratio is poor.  \nNo obvious attempt to strip out irrelevant specs or HTML markup, so more than half the possible points are lost.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original table structure, headings, and row associations are intact, so relationships (e.g., “V<sub>F</sub>” belongs to BAV99) are preserved.  \n• HTML tags are wrapped in a Markdown code block, which keeps context and prevents accidental rendering—useful for the downstream parser.  \n• Minor issues: some whitespace compression and the outer page context is gone, but nothing critical. Overall fidelity is high.\n\nTOTAL SCORE: 73/100\n\nKEY STRENGTHS:  \n- Captured both VR and VF values together with their units and qualifiers.  \n- Maintains table structure, easing downstream parsing.  \n- Bullet feature list provides a redundant voltage reference, improving robustness.\n\nKEY WEAKNESSES:  \n- Heavy inclusion of non-voltage columns, current specs, package data, and entire HTML scaffolding.  \n- If the source page held additional voltage ratings outside this snippet, they were missed.  \n- No attempt to normalize or highlight voltage data for easier extraction.\n\nVERDICT: Solid at keeping the voltage numbers it saw and preserving structure, but weak at filtering out extraneous material, leaving downstream components to sift through a lot of noise.",
      "success": true,
      "timestamp": "2025-07-10T16:34:00.018290"
    },
    {
      "run_id": 20,
      "strategy": "recall",
      "iteration": 5,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 20 | Iteration: 5\n\nRETAINING_TARGET_INFORMATION: 16/33  \n• Captured reverse-voltage rating twice (product blurb and parametrics table).  \n• Did NOT capture any forward-voltage (VF) data, which is a core part of the target.  \n• No other voltage-related parameters such as peak repetitive reverse voltage or surge voltage.  \n• Therefore only ~40 % of expected voltage information retained.\n\nELIMINATING_NON_RELEVANT: 14/33  \n• 5 captured blocks, but only the first two contain voltage info; the other three (ordering, RoHS, chemical content) are unrelated.  \n• Roughly 70 % of the retained tokens are noise.  \n• No obvious over-filtering, but under-filtering is significant, hurting signal-to-noise.\n\nPRESERVING_INPUT_DATA: 26/34  \n• Maintains section titles and “---” separators, so contextual placement is clear.  \n• Voltage lines preserved verbatim; HTML subscripts retained (V<sub>R</sub>).  \n• Some minor restructuring (original column headers simplified), but hierarchy still intelligible.  \n• Because large chunks were dropped, the output is shorter yet coherent; no mis-association of numbers.\n\nTOTAL SCORE: 56/100\n\nKEY STRENGTHS:  \n- Reverse-voltage information accurately captured and duplicated for redundancy.  \n- Clear sectioning keeps context understandable.  \n- Formatting (subscripts, table labels) largely preserved.\n\nKEY WEAKNESSES:  \n- Forward-voltage and other voltage specs completely missing.  \n- High proportion of non-voltage data (ordering, environmental), lowering precision.  \n- Filter did not prioritize voltage-relevant rows within mixed tables.\n\nVERDICT: Adequate at catching reverse-voltage details, but poor coverage of all voltage specs and noisy output make this filter pass only moderately successful.",
      "success": true,
      "timestamp": "2025-07-10T16:34:29.050789"
    },
    {
      "run_id": 21,
      "strategy": "liberal",
      "iteration": 6,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 21 | Iteration: 6  \n\nRETAINING_TARGET_INFORMATION: 26/33  \nThe output keeps the complete parametric table that contains the two main voltage items expected:  \n• Reverse voltage:  “V​R [max] (V) – 100 V” is preserved.  \n• Forward voltage:  “V​F [max] (mV) – 1000 @ IF = 50 mA” is preserved.  \nThese appear in the same row, so their relationship to device conditions is intact.  \nNo other voltage-related columns (e.g., “breakdown voltage”, “clamp voltage” etc.) exist on the source page, so nothing obvious is missing.  \nA minor omission is the empty early stub table that lists the header “V​R [max] (V)” without its value; ideally that value (100 V) would also have been repeated there. Overall, essentially all voltage data that really exists on the page made it through.\n\nELIMINATING_NON_RELEVANT: 14/33  \nThe filter is very permissive (“liberal”) and therefore drags along large portions of non-voltage text:  \n• Marketing text, features, applications – all non-voltage.  \n• Two full “Ordering, pricing & availability” tables, including packing, quantity and buy-online columns.  \n• Environmental (RoHS/RHF) table.  \n• Current-related, capacitance, recovery-time, configuration and automotive qualification columns inside the parametric table.  \nWhile some noise inside the parametric table is acceptable to keep context, two extra big tables and general prose clearly lower the signal-to-noise ratio. Only a small amount of genuinely irrelevant HTML boiler-plate (divs etc.) has been stripped, but most functional non-voltage content remains.\n\nPRESERVING_INPUT_DATA: 27/34  \n• Key HTML structure (headers, tables, rows, columns) is maintained, meaning a downstream parser can still locate voltage values by header.  \n• Context (units, test conditions, column associations) is intact.  \n• Minor formatting glitches exist: the first “Parametrics” section shows only a header row with no value; inconsistent closing of the triple “---” separators; but these do not seriously harm coherence.  \n• Duplicate information (same type number repeated) is preserved, matching the original hierarchy.\n\nTOTAL SCORE: 67/100  \n\nKEY STRENGTHS:  \n- Both critical voltage specifications (V​R and V​F) are present with units and test conditions.  \n- Table structure preserved, easing further parsing.  \n- No major corruption or loss of data.\n\nKEY WEAKNESSES:  \n- Considerable amount of non-voltage information retained (ordering, environmental, marketing).  \n- Early “Parametrics” teaser section loses the V​R value, creating redundancy/confusion.  \n- Minor formatting inconsistencies could complicate automated downstream processing.\n\nVERDICT: Delivers the essential voltage data but with a high volume of unrelated content, providing a usable yet noisy result.",
      "success": true,
      "timestamp": "2025-07-10T16:34:56.038711"
    },
    {
      "run_id": 22,
      "strategy": "inclusive",
      "iteration": 6,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 22 | Iteration: 6\n\nRETAINING_TARGET_INFORMATION: 27/33  \n• Reverse voltage is captured twice – once in the bullet (“Reverse voltage: V₍R₎ ≤ 100 V”) and again in the parametric table column “V₍R₎ [max] (V) = 100”.  \n• Forward-voltage data are present in the “V₍F₎ [max] (mV) = 1000 @ I_F = 50 mA” cell.  \n• All voltage-related table headers (VR, VF) are intact; no voltage column has been dropped.  \n• However, if the original page contained other voltage parameters (e.g., surge reverse voltage, breakdown voltage at temperature, ESD ratings), they are not shown, so completeness cannot be guaranteed.  \n• Overall, the main voltage specs that appear in the source snippet were preserved.\n\nELIMINATING_NON_RELEVANT: 18/33  \n• Entire table was kept, so non-voltage columns (current, capacitance, size, package, t_rr, configuration, automotive flag) account for more than 50 % of the tokens.  \n• Bullet list and headings are voltage-related, but the surrounding HTML scaffolding (<ul>, <table> classes, tool-tip spans, etc.) adds further noise.  \n• No outright irrelevant narrative text is present, but the filter clearly favored inclusiveness over precision, yielding a middling signal-to-noise ratio for voltage extraction.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original hierarchy (heading, bullet list, responsive-table wrapper, thead, tbody) is intact, so downstream parsers can still rely on structure.  \n• All column headers align with their row values, preserving context between VR/VF and the device (BAV99).  \n• Minor cosmetic loss: leading / trailing whitespace compressed, but no data loss.  \n• HTML entities and subscript tags kept, maintaining clarity of symbols (V₍R₎, V₍F₎).\n\nTOTAL SCORE: 75/100\n\nKEY STRENGTHS:  \n- Captured both reverse and forward voltage values with their limits and conditions.  \n- Maintained the full parametric table, keeping voltage specs tied to the correct device.  \n- HTML structure preserved, facilitating easy downstream parsing.\n\nKEY WEAKNESSES:  \n- Large amount of non-voltage information retained (currents, packaging, dimensions, etc.).  \n- Potentially missed additional voltage ratings not present in this snippet.  \n- Extra markup and tooltip elements slightly reduce clarity.\n\nVERDICT: Good overall retention of voltage information with solid structural fidelity, but filtering could be more selective to improve the voltage-to-noise ratio.",
      "success": true,
      "timestamp": "2025-07-10T16:35:16.684988"
    },
    {
      "run_id": 23,
      "strategy": "contextual",
      "iteration": 6,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 23 | Iteration: 6\n\nRETAINING_TARGET_INFORMATION: 28/33  \n• Reverse-voltage information is captured three times:  \n  – Parametric table column “V<sub>R</sub> [max] (V)” with the value 100 V  \n  – Features list bullet “Reverse voltage: V<sub>R</sub> ≤ 100 V”  \n  – Replicated parametric section (second table)  \n• Forward-voltage information is present once: “V<sub>F</sub> [max] (mV)” with the value 1000 mV @ I<sub>F</sub>=50 mA.  \n• No other voltage-related parameters appear on the source page, so nothing is missing.  \n• Minor shortcoming: the forward-voltage line includes the current condition, but that is acceptable; however, the filter did not isolate the voltage value (1000 mV) by itself, which can complicate downstream parsing.  \n• Overall, all voltage elements that existed in the source were retained.\n\nELIMINATING_NON_RELEVANT: 15/33  \n• The output still contains the entire product table (package, size, currents, capacitance, t<sub>rr</sub>, automotive qualification, configuration) and the complete “Features and benefits” list.  \n• Current-related specs (I<sub>FSM</sub>, I<sub>R</sub>, I<sub>F</sub>, I<sub>FRM</sub>) and capacitance (C<sub>d</sub>) dominate the table and clutter the text.  \n• Packaging data, mechanical dimensions, HTML scaffolding, and duplicated tables remain.  \n• Roughly 20-25 % of the kept content is voltage related; the rest is noise.  \n• Little attempt was made to strip HTML or duplicate sections, further reducing the signal-to-noise ratio.\n\nPRESERVING_INPUT_DATA: 30/34  \n• All original rows, column headers, bullet lists, and hierarchy are intact; the reader can still map values to labels without ambiguity.  \n• Markdown fencing was kept, ensuring parsers can recognise the section.  \n• HTML tags remain, but they match the source order, so context is preserved.  \n• Duplication of the full parametric table (appears twice) slightly hurts clarity but does not corrupt structure.  \n• No truncation or data corruption observed.\n\nTOTAL SCORE: 73/100\n\nKEY STRENGTHS:  \n- Captured every voltage-related value present in the page.  \n- Maintained clear association between voltage numbers and their labels.  \n- Structural fidelity (tables, headers) preserved for downstream parsers.\n\nKEY WEAKNESSES:  \n- Large amount of non-voltage information left in place, lowering precision.  \n- Duplicate table increases noise.  \n- Voltage values are embedded with current conditions (e.g., “1000@IF=50 mA”) which may need extra parsing.\n\nVERDICT: Solid at retaining the required voltage data and keeping structure, but filtering is too permissive, leaving considerable irrelevant content that reduces extraction efficiency.",
      "success": true,
      "timestamp": "2025-07-10T16:35:35.559334"
    },
    {
      "run_id": 24,
      "strategy": "recall",
      "iteration": 6,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 24 | Iteration: 6\n\nRETAINING_TARGET_INFORMATION: 22/33  \n• Captured the two core voltage items that were explicitly present in the source (Reverse voltage VR ≤ 100 V and Forward voltage VF ≤ 1000 mV @ 50 mA).  \n• Indicates that the values come from the “Parametrics” section and repeats the VR value found in “Features and benefits”, so redundancy is good.  \n• However, other voltage-related ratings that are almost always present on an NXP BAV99 page (e.g., VRRM, VRWM, V(pk), V(RMS), ESD voltage, surge voltage, storage-related voltages) are absent.  \n• No range or temperature-dependent voltage data, no absolute maximum ratings block, and no context such as “at IF = …” for VF beyond one value.  \n• Consequently, only a subset of the likely voltage data was retained.\n\nELIMINATING_NON_RELEVANT: 20/33  \n• Some non-voltage data (t_rr, applications bullet, environmental / RoHS table) was allowed through; none of it helps the downstream “voltage” parser.  \n• Roughly 35-40 % of the tokens in the output are unrelated to voltage.  \n• Still, large unrelated areas of the full product sheet (mechanical, current specs, temperature ratings, ordering codes, etc.) have been successfully excluded, so noise is moderate rather than excessive.\n\nPRESERVING_INPUT_DATA: 25/34  \n• Maintains a recognizable section structure with clearly labeled breaks (“---”) and bullet lists.  \n• Voltage figures are kept together with their labels, preserving the parameter-value relationship.  \n• Formatting is clean and readable, but it is a re-write, not a verbatim excerpt; column headers like “Parameter”, “Symbol”, “Conditions” are lost.  \n• Minor contextual wording (“Here are all the sections…”) adds prose that would need to be stripped later but does not destroy coherence.\n\nTOTAL SCORE: 67/100\n\nKEY STRENGTHS:\n- Captured both VR and VF primary specifications.\n- Removed large portions of obviously irrelevant source material.\n- Output is organized and easy to parse programmatically.\n\nKEY WEAKNESSES:  \n- Misses other voltage ratings likely present in the original document (peak reverse, surge, RMS, etc.).  \n- Allows several clearly non-voltage lines (t_rr, environmental, application text) to pass the filter.  \n- Loses original tabular context, which may hinder precise downstream parsing.\n\nVERDICT: A decent but incomplete recall-oriented filter run; it keeps the main VR/VF values but misses several other voltage specs and lets moderate noise through.",
      "success": true,
      "timestamp": "2025-07-10T16:36:12.823150"
    },
    {
      "run_id": 25,
      "strategy": "liberal",
      "iteration": 7,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 25 | Iteration: 7\n\nRETAINING_TARGET_INFORMATION: 29/33  \n• Reverse-voltage data (VR ≤ 100 V) is captured in every chunk where it appears (features, parametrics, package, ordering, environmental, reliability).  \n• Forward-voltage information (VF max = 1000 mV @ IF = 50 mA) is present in the product-details parametric table.  \n• Voltage limits are preserved with their qualifiers (“max”, test conditions, units).  \n• No other voltage-related parameters seem to be present in the source excerpt, so nothing obvious is missing.  \n• Minor point loss because the “voltage” chunk does not repeat the forward-voltage spec, so a consumer that only looks at that dedicated chunk would miss VF.  \n\nELIMINATING_NON_RELEVANT: 12/33  \n• Large amount of non-voltage text kept: switching-speed, capacitance, leakage current, package size, order codes, RoHS, reliability programme, applications, packing quantity, etc.  \n• For roughly every line of voltage data there are 2–3 lines of unrelated information, leading to a mediocre signal-to-noise ratio.  \n• Only one clearly irrelevant chunk (“ordering, pricing & availability”) could have been dropped without losing any unique voltage spec; same for “environmental” and “reliability” which just duplicate VR.  \n• Some duplication of the same VR=100 V spec across five chunks adds verbosity without informational gain.  \n\nPRESERVING_INPUT_DATA: 30/34  \n• Markdown hierarchy (**Chunk name**, ***section***, bullet lists) is retained, making the output easy to parse.  \n• Original parameter tables are intact, including units, test conditions and contextual labels.  \n• Relationships (e.g., VF value tied to IF=50 mA) are preserved.  \n• Minor formatting drift: blank lines added/removed and “Reverse voltage” appears both in prose and table rows, but no loss of clarity.  \n• “NO_CONTENT_FOUND” footer from the framework sneaks in—small noise but still well-formed.  \n\nTOTAL SCORE: 71/100  \n\nKEY STRENGTHS:  \n- Captures all VR data and the sole VF spec with units and conditions.  \n- Maintains clear, parse-friendly structure.  \n- No truncation or corruption of technical values.  \n\nKEY WEAKNESSES:  \n- Considerable non-voltage information retained, lowering extraction purity.  \n- Forward-voltage spec not echoed in the dedicated “voltage” chunk.  \n- Duplicate VR lines inflate token count without adding substance.  \n\nVERDICT: Solid at retaining voltage details but too liberal in keeping unrelated content; good structure, moderate noise.",
      "success": true,
      "timestamp": "2025-07-10T16:36:45.800412"
    },
    {
      "run_id": 26,
      "strategy": "inclusive",
      "iteration": 7,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 26 | Iteration: 7\n\nRETAINING_TARGET_INFORMATION: 30/33  \n• Both reverse voltage (V_R = 100 V) and forward voltage (V_F = 1000 mV @ I_F = 50 mA) are present in the parametric table.  \n• Reverse-voltage limit also appears in the “Features and benefits” list (V_R ≤ 100 V).  \n• Voltage headers are clearly retained in the table (V_R [max], V_F [max]); therefore downstream parsers can reliably locate them.  \n• No obvious voltage datum contained in the source appears to be lost (only one product row was shown).  \n• Minor risk that other voltage figures that might have existed elsewhere on the full page were not captured, but within the provided snapshot coverage looks complete.\n\nELIMINATING_NON_RELEVANT: 15/33  \n• The filter kept the entire parametric table. Eleven of the thirteen columns (package, size, currents, capacitance, t_rr, etc.) are unrelated to voltage.  \n• Non-voltage bullets (switching speed, capacitance, package comment) are also kept.  \n• Overall S/N ratio is low: roughly 15–20 % of the retained tokens are about voltage.  \n• No active attempt to strip packaging text, mechanical data, or current specs → significant noise remains.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original HTML hierarchy (row/col/table/thead/tbody) is intact; tags, units and annotations are preserved.  \n• Column order and association of each value with its header are maintained, so relationships stay clear.  \n• Contextual bullet list is unchanged.  \n• Minor issues: extra leading/trailing whitespace and the page sections before/after the voltage data were removed, but this does not harm comprehension.\n\nTOTAL SCORE: 75/100\n\nKEY STRENGTHS:\n- Captured all explicit voltage specifications (V_R, V_F) with units and conditions.\n- Maintains full structural context, enabling accurate downstream parsing.\n- No corruption or re-ordering of technical data.\n\nKEY WEAKNESSES:  \n- Retains a large amount of non-voltage information (currents, package details, timing, capacitance).  \n- Inclusive strategy offers poor signal-to-noise ratio for voltage-centric extraction.  \n- Possible omission if other voltage specs existed outside the captured fragment.\n\nVERDICT: Solid at preserving and retaining voltage data, but filtering is too loose—excessive unrelated specs reduce efficiency for a dedicated voltage extractor.",
      "success": true,
      "timestamp": "2025-07-10T16:37:11.782872"
    },
    {
      "run_id": 27,
      "strategy": "contextual",
      "iteration": 7,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 27 | Iteration: 7\n\nRETAINING_TARGET_INFORMATION: 29/33  \n• Both reverse-voltage values are present:  \n  – “Reverse voltage: V₍R₎ ≤ 100 V” in the feature list  \n  – “V₍R₎ [max] (V) = 100” in the parametric table  \n• Forward-voltage value is present: “V₍F₎ [max] (mV) = 1000 @ I_F = 50 mA”.  \n• No other voltage-related columns exist on the source page, so nothing appears to be missing.  \n• Context (limits, units, operating condition) is preserved.  \n• Minor deduction because the forward-voltage value is kept with the current condition in a single cell (“1000@IF=50mA”); splitting the numeric voltage from its condition would have simplified downstream parsing.\n\nELIMINATING_NON_RELEVANT: 18/33  \n• Large amount of non-voltage data is still present: current ratings (I_FSM, I_R, I_FRM, I_F), capacitance, recovery time, package, size, qualification, etc.  \n• The entire “Features and benefits” section is kept, yet only one bullet contains voltage information.  \n• Table columns unrelated to voltage were not pruned.  \n• Roughly one-third of the retained tokens relate to voltage, so the signal-to-noise ratio is mediocre.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original markdown headings, bullet list, and HTML table structure were fully preserved, aiding context retention.  \n• Column headings and units remain intact, so relationships between values are clear.  \n• Minor mark-down artifacts (e.g., raw HTML classes) are harmless but slightly cluttered.  \n• No noticeable formatting corruption or data loss.\n\nTOTAL SCORE: 77/100\n\nKEY STRENGTHS:  \n- Captured every voltage specification available (VR and VF).  \n- Maintained clear context, units, and table relationships.  \n- Good structural fidelity; easy for a parser to locate voltage fields.\n\nKEY WEAKNESSES:  \n- Did little filtering; many non-voltage specs and marketing bullets remain.  \n- Voltage value and its test condition are concatenated, complicating parsing.  \n- Potential token waste due to unneeded HTML attributes and non-voltage rows/columns.\n\nVERDICT: Solid retention of voltage information with good structural preservation, but filtering aggressiveness is low, leaving significant irrelevant data.",
      "success": true,
      "timestamp": "2025-07-10T16:37:34.261342"
    },
    {
      "run_id": 28,
      "strategy": "recall",
      "iteration": 7,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 28 | Iteration: 7  \n\nRETAINING_TARGET_INFORMATION: 14/33  \n- Reverse-voltage information (VR ≤ 100 V) is captured three times, so the most basic rating is present.  \n- No forward-voltage (VF) specification is included, even though this is a standard diode parameter and was part of the expected target set.  \n- No other voltage‐related ratings appear (e.g., peak repetitive reverse voltage, surge voltage, breakdown voltage, clamping voltages, etc.).  \n- Because roughly half of the expected voltage data is absent, the score is limited to slightly under mid-range.\n\nELIMINATING_NON_RELEVANT: 22/33  \n- The majority of the text is about voltage, but there are notable intrusions:  \n  • “High switching speed: t_rr ≤ 4 ns” (time parameter, not voltage)  \n  • A RoHS environmental note that is unrelated to voltage  \n  • Duplicate lines (“VR [max] 100 V”) inflate length without adding new signal  \n- No current, power-dissipation, or mechanical dimensions were copied, so noise is moderate rather than heavy.\n\nPRESERVING_INPUT_DATA: 26/34  \n- The extractor kept a clean section structure (Product Features, Parametrics Table, Package Table, Environmental Table).  \n- Bullet formatting and parameter labels (e.g., “V_R [max] (V): 100”) are intact, preserving context for a downstream parser.  \n- However, original table headers/columns are flattened into bullet points, so some relational structure is lost.  \n- Repetition of the same datum from multiple tables is acceptable but not ideal. Minor coherence issues (RoHS line claims it “applies to the product’s voltage characteristics,” which is misleading).\n\nTOTAL SCORE: 62/100  \n\nKEY STRENGTHS:  \n- Captures at least one critical voltage rating (VR max).  \n- Output is concise and easy for a parser to scan.  \n- Basic section labeling and formatting preserved.\n\nKEY WEAKNESSES:  \n- Forward-voltage (VF) and other voltage ratings completely missing.  \n- Includes a few irrelevant or misleading lines (t_rr, RoHS).  \n- Some structural flattening; duplicate values reduce efficiency.\n\nVERDICT: Adequate first-pass filter that finds reverse voltage but misses other key voltage specs and lets in moderate noise, yielding a middling overall quality.",
      "success": true,
      "timestamp": "2025-07-10T16:37:54.415550"
    },
    {
      "run_id": 29,
      "strategy": "liberal",
      "iteration": 8,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 29 | Iteration: 8\n\nRETAINING_TARGET_INFORMATION: 28/33  \n• Reverse-voltage data are present twice  \n  – Bullet list: “Reverse voltage: V R ≤ 100 V”  \n  – Parametric table: column “V R [max] (V)” = 100 V for BAV99  \n• Forward-voltage information captured: column “V F [max] (mV)” = 1000 mV @ I F = 50 mA  \n• All voltage-related fields that exist in the source snippet (V R, V F) are preserved.  \n• No other voltage parameters (e.g., peak reverse voltage, breakdown voltage at temperature) were present in the source so nothing is missing.  \n• Minor issue: the “Voltage” columns are embedded in a full table; they are not isolated, which may slightly complicate the downstream parser.  \n\nELIMINATING_NON_RELEVANT: 12/33  \n• Large amount of unrelated data kept: current ratings (I FSM, I R, I FRM, I F), capacitance, recovery time, package size, configuration, RoHS, RHF, chemical content.  \n• Two full “Environmental information” rows retained – completely irrelevant to voltage.  \n• Descriptive bullet list also keeps non-voltage points (switching speed, capacitance, leakage, package).  \n• Signal-to-noise ratio is poor: only ~15-20 % of the kept tokens are voltage specific.  \n\nPRESERVING_INPUT_DATA: 28/34  \n• Original HTML structure (headings, tables, rows, columns) is almost perfectly intact, enabling easy contextual parsing.  \n• Parameter relationships (voltage values associated with “BAV99” row) are preserved.  \n• Minor markdown/HTML consistency issues (mixed “---” separators, blank lines) but nothing that harms interpretability.  \n\nTOTAL SCORE: 68/100\n\nKEY STRENGTHS:  \n- Captures both reverse and forward voltage specs with correct numeric values.  \n- Maintains table structure, so voltage data stay connected to the correct part number.  \n- No critical voltage information appears to be lost.\n\nKEY WEAKNESSES:  \n- Retains a large amount of non-voltage information (currents, capacitance, environmental tables, packaging).  \n- Voltage data are not highlighted or isolated, reducing extraction efficiency for the next stage.  \n- Slight redundancies (duplicate VR value in bullet list and table).\n\nVERDICT: The liberal filter keeps all necessary voltage details but at the cost of significant noise; overall acceptable yet far from optimal for a clean voltage-only extraction.",
      "success": true,
      "timestamp": "2025-07-10T16:38:13.998647"
    },
    {
      "run_id": 30,
      "strategy": "inclusive",
      "iteration": 8,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 30 | Iteration: 8  \n\nRETAINING_TARGET_INFORMATION: 27/33  \n• Reverse-voltage data captured twice: the list item “Reverse voltage: V₍R₎ ≤ 100 V” and the table column “V₍R₎ [max] (V) → 100”.  \n• Forward-voltage data captured: table column “V₍F₎ [max] (mV) → 1000 @ I₍F₎ = 50 mA”.  \n• Both voltage parameters remain in their original technical context (column headers preserved).  \n• No other voltage-related columns appear on the page snippet, so nothing obvious is missing; however, because the full page usually contains ratings such as V_RRM or surge voltage, there is a moderate risk that some voltage lines that were farther down the source page were dropped.  \n• Overall, the essential VR and VF information is present, but completeness relative to the full page is uncertain.  \n\nELIMINATING_NON_RELEVANT: 18/33  \n• A large amount of non-voltage data is still present: package version/name, size, I_FSM, I_R, I_FRM, configuration, t_rr, I_F, capacitance, automotive flag.  \n• Only one genuinely irrelevant introductory bullet (“dual series”) was removed; most of the specification table was kept intact.  \n• Signal-to-noise ratio is moderate: roughly 30 % of the retained tokens relate to voltage; the rest is current, mechanical, or qualification data.  \n• No descriptive marketing text survived, so some pruning occurred, but the filter is far from “voltage-only.”  \n\nPRESERVING_INPUT_DATA: 28/34  \n• HTML structure (unordered list, table with thead / tbody) is intact, which helps downstream parsers understand parameter relationships.  \n• Column headers and units are preserved, so context is clear.  \n• Minor formatting quirks (extra spaces, trailing spaces in cells) but nothing that breaks coherence.  \n• The original page almost certainly contained multiple sections; only the “Parametrics” block was kept, so some macro-level structure is lost—still acceptable for a filter step focused on spec data.  \n\nTOTAL SCORE: 73/100  \n\nKEY STRENGTHS:  \n- Captures both VR and VF values with units and operating conditions.  \n- Maintains table headers and hierarchy, preserving context for parsers.  \n- Removes narrative/marketing text, keeping the payload concise.  \n\nKEY WEAKNESSES:  \n- Retains many non-voltage parameters, lowering signal-to-noise ratio.  \n- Possible omission of additional voltage ratings elsewhere on the page (e.g., VRRM, surge voltages).  \n- Minor inline clutter (size, package) that could have been filtered out.  \n\nVERDICT: A reasonably good inclusive filter for voltage extraction—core voltage specs are present and well-structured, but extra non-voltage columns remain and some voltage data may still be missing, so further refinement is advised.",
      "success": true,
      "timestamp": "2025-07-10T16:38:38.400690"
    },
    {
      "run_id": 31,
      "strategy": "contextual",
      "iteration": 8,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 31 | Iteration: 8\n\nRETAINING_TARGET_INFORMATION: 27/33  \n• Reverse-voltage information is present twice:  \n  – Table column “V₍R₎ [max] (V)” → value 100 V  \n  – Feature list item “Reverse voltage: V₍R₎ ≤ 100 V”  \n• Forward-voltage information is captured:  \n  – Table column “V₍F₎ [max] (mV)” → value “1000 @ IF = 50 mA”  \n• The only voltage-related parameters that exist in the source table (VR and VF) are preserved. No evidence of additional voltage fields (e.g., VRRM, VESD, surge voltage) was seen in the source, so nothing is missing.  \n• Context (max/conditions) is kept (“@ IF = 50 mA”).  \nMinor issue: The section header “Voltage” is kept, but no explanatory sentence describing voltage limits outside the table; however, all numeric voltage data shown in the snippet is retained.  \n\nELIMINATING_NON_RELEVANT: 15/33  \n• A large amount of non-voltage material remains: package version/name, size, I_FSM, I_FRM, current limits, capacitance, configuration, t_rr, automotive qualified flag, feature & benefit bullets not related to voltage, application list, etc.  \n• Only 2 of the 13 table columns are voltage-related; the other 11 are noise for this task.  \n• Entire “Features and benefits” and “Applications” lists are kept; only one bullet in “Features” is about voltage.  \n• Signal-to-noise ratio is therefore low—roughly 15-20 % of tokens are voltage-specific. Some pruning occurred (the rest of the original web page is gone), but the filter is far from selective.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original hierarchy retained: section header, horizontal rules, full HTML table inside a responsive div, followed by lists.  \n• Table column headings and units remain intact; row associations preserved.  \n• Markdown/HTML hybrid formatting is unchanged, which is valuable for the downstream parser.  \n• Minor loss: surrounding page context (intro text, other tables) is obviously removed, but within the kept snippet the structure is faithful.  \n• No corrupt tags or reordered data observed.\n\nTOTAL SCORE: 72/100\n\nKEY STRENGTHS:\n- Captured both VR and VF values with conditions and units.\n- Maintained table structure and relationships, aiding later parsing.\n- Removed the vast majority of the rest of the (unknown) original page, so runtime and token cost are low.\n\nKEY WEAKNESSES:  \n- Kept many non-voltage columns and narrative sections, lowering relevance.  \n- Could have trimmed current, capacitance, t_rr, packaging, and application information without harming voltage extraction.  \n- No explicit highlighting or consolidation of voltage values—downstream component must still sift through noise.\n\nVERDICT: Solid at preserving all required voltage data and keeping formatting, but the filter is overly inclusive and allows a considerable amount of non-voltage information to pass through.",
      "success": true,
      "timestamp": "2025-07-10T16:38:59.167317"
    },
    {
      "run_id": 32,
      "strategy": "recall",
      "iteration": 8,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 32 | Iteration: 8\n\nRETAINING_TARGET_INFORMATION: 28/33  \n• Reverse voltage (V_R ≤ 100 V) appears twice – within the “Features” bullet list and in the parametric table column “V_R [max] (V)”.  \n• Forward voltage (V_F [max] = 1000 mV @ I_F = 50 mA) is present in the table.  \n• No other voltage-related columns on the page (peak repetitive reverse voltage, ESD withstand, breakdown voltages, etc.) are visible in the output, so if they existed they were lost; if they did not exist, nothing is missing.  \n• Voltage units and operating conditions (e.g. “@ IF=50 mA”) have been preserved.  \n→ Overall, the essential voltage specs that are actually shown on the product web page were captured, but the possibility of missing secondary voltage limits keeps it from full marks.\n\nELIMINATING_NON_RELEVANT: 12/33  \n• Entire “Environmental information” and “Ordering, pricing & availability” tables—completely unrelated to voltage—are retained.  \n• Parametric columns for current, capacitance, t_rr, package size, configuration, automotive qualification, etc., remain.  \n• Descriptive text (product overview, generic features, RoHS icons) is also kept.  \n• Roughly 70-75 % of the tokens are non-voltage data, yielding a poor signal-to-noise ratio.  \n→ Significant irrelevant content means a large penalty.\n\nPRESERVING_INPUT_DATA: 28/34  \n• Original sectioning with headings (“### Features and benefits”, “### Parametrics”, …) is intact.  \n• HTML table structure is preserved so downstream parsers still know the context of V_R and V_F.  \n• Minor issues: some tooltip attributes were stripped while others remained; there’s a small typo in “tooltopTrigger”.  \n• Overall coherence and readability are good.\n\nTOTAL SCORE: 68/100\n\nKEY STRENGTHS:  \n- Captures both reverse and forward voltage values with units and test conditions.  \n- Maintains table structure, allowing easy downstream parsing.  \n- Keeps voltage specs in multiple contexts (feature list + parametric table).\n\nKEY WEAKNESSES:  \n- Large amount of non-voltage information retained, hurting precision.  \n- Possible omission of any secondary/absolute maximum voltage ratings if they existed outside the copied fragments.  \n- Minor formatting inconsistencies.\n\nVERDICT: Solid recall of voltage data but weak filtering discipline; good for completeness, less so for precision.",
      "success": true,
      "timestamp": "2025-07-10T16:39:29.170892"
    },
    {
      "run_id": 33,
      "strategy": "liberal",
      "iteration": 9,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 33 | Iteration: 9\n\nRETAINING_TARGET_INFORMATION: 29/33  \n- Reverse voltage (VR) is present twice: once in the bullet feature (“Reverse voltage: V_R ≤ 100 V”) and again in the parametric table column “V_R [max] (V) = 100”.  \n- Forward voltage (V_F) is captured in the parametric table (“V_F [max] (mV) = 1000 @ IF = 50 mA”).  \n- No other voltage-related columns exist in this data set (e.g., no breakdown, avalanche, gate, or storage voltage), so nothing else is missing.  \n- Small deduction because the “1000 mV” forward voltage is embedded with current conditions and might need additional parsing; an ideal filter might have isolated “1 V” itself.\n\nELIMINATING_NON_RELEVANT: 14/33  \n- Large amounts of non-voltage information remain: currents (I_FSM, I_FRM, I_F, I_R), capacitance (C_d), recovery time (t_rr), package name, size, configuration, automotive qualification, full ordering table with packing quantity, part numbers, status links, etc.  \n- Only a minority of the retained text is strictly voltage-related; signal-to-noise ratio is mediocre.  \n- No obvious attempt to drop entire non-voltage columns (e.g., the whole ordering table is preserved).  \n\nPRESERVING_INPUT_DATA: 30/34  \n- Original HTML structure (sections, headings, tables) is largely intact; this will help a downstream parser.  \n- Voltage specs remain in their original table cells with column headers, preserving context/relationships.  \n- Minor tagging errors inherited from the source are still present but do not hurt comprehension.  \n- Truncation occurs after the last table (“NO_CONTENT_FOUND”), but it seems nothing voltage-related followed, so only a slight penalty.\n\nTOTAL SCORE: 73/100\n\nKEY STRENGTHS:  \n- Captured both reverse and forward voltage values in multiple places.  \n- Maintained table headers and layout, aiding contextual understanding.  \n- No voltage figure appears to be lost or altered.\n\nKEY WEAKNESSES:  \n- Filter is too “liberal”; brings along extensive non-voltage data (currents, packing, ordering, links).  \n- Voltage numbers are sometimes embedded with current conditions, requiring extra parsing.  \n- Minor truncation marker (“NO_CONTENT_FOUND”) indicates potential loss of tail content, though not critical here.\n\nVERDICT: Good voltage coverage but poor noise suppression; acceptable for downstream parsing, yet efficiency could be much higher.",
      "success": true,
      "timestamp": "2025-07-10T16:39:49.656749"
    },
    {
      "run_id": 34,
      "strategy": "inclusive",
      "iteration": 9,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 34 | Iteration: 9\n\nRETAINING_TARGET_INFORMATION: 27/33  \n• Positive: The snippet includes the explicit textual spec “Reverse voltage: V₍R₎ ≤ 100 V”.  \n• The parametric table carries both voltage columns:  \n  – “V₍R₎ [max] (V)” with the value 100 (reverse voltage rating)  \n  – “V₍F₎ [max] (mV)” with the value “1000 @ IF = 50 mA” (forward voltage drop).  \n• These appear for the only listed type number (BAV99), so nothing is lost for that device.  \n• No other voltage-related columns (e.g., peak repetitive reverse voltage, breakdown voltage, surge voltage) are present in the source, so none are missing.  \n• Minor issue: the forward-voltage value is preserved but embedded in current context (“@IF=50 mA”) which is acceptable; however, units remain mV (should ideally be V).  \n• Overall, all voltage data available in the captured HTML are retained.\n\nELIMINATING_NON_RELEVANT: 18/33  \n• The filter passes the entire row of the parametric table. Columns such as I_FSM, I_R, I_FRM, t_rr, I_F, C_d, package version/name/size, configuration and automotive qualification are not voltage-related.  \n• It also carries markup headers, Bootstrap classes, and generic table scaffolding that are unnecessary for a pure voltage-focused pass.  \n• Only a small attempt at pre-filtering is visible (the snippet starts after a first “---”), but ~60-70 % of the surviving tokens are not voltage information, so signal-to-noise is mediocre.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original hierarchy (list element, headings, table with thead/tbody) is kept, so a downstream parser can still navigate by tags.  \n• All header labels and cell/row associations are intact, preserving the relationship between type number and its voltage specs.  \n• Minor losses: outer HTML (doctype, <html>, etc.) and earlier/later context are trimmed, and the delimiters (“---”) are injected. These do not harm voltage context, but they slightly diverge from source fidelity.  \n• Overall coherence and readability remain high.\n\nTOTAL SCORE: 75/100\n\nKEY STRENGTHS:\n- Captures every voltage-related datum that exists in the provided chunk.\n- Maintains table structure, preserving context for easy parsing.\n- Clean, readable snippet; no critical information corruption.\n\nKEY WEAKNESSES:  \n- Passes a large amount of non-voltage information (currents, packages, capacitance, etc.).  \n- Minor formatting additives (“---”, markdown fence) not part of original HTML.  \n- Does not normalise or highlight voltage columns; forward-voltage units left in mV string.\n\nVERDICT: Solid retention of voltage specs with good structural preservation, but filtering is too permissive, letting substantial non-voltage noise through.",
      "success": true,
      "timestamp": "2025-07-10T16:40:06.367673"
    },
    {
      "run_id": 35,
      "strategy": "contextual",
      "iteration": 9,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 35 | Iteration: 9\n\nRETAINING_TARGET_INFORMATION: 30/33  \nThe filter retained every voltage-related datum that appears in the source snippet:  \n• Reverse voltage (VR ≤ 100 V) is present twice – once in the features list and again in the “V₍R₎ [max]” parametric column.  \n• Forward voltage (V₍F₎ [max] = 1000 mV @ IF = 50 mA) is captured from the table.  \n• No other voltage parameters (break-down voltage, surge voltage, etc.) exist in the supplied page, so nothing is missing.  \nMinor deduction because the forward-voltage cell retains the current condition inline (“@IF=50 mA”) rather than isolating pure voltage, which may make downstream parsing harder.\n\nELIMINATING_NON_RELEVANT: 18/33  \nLarge amounts of non-voltage information remain:  \n• The entire Features list keeps speed, capacitance, leakage, package size, etc.  \n• The parametric table retains every non-voltage column (current, capacitance, configuration, qualification).  \n• A complete “Ordering, pricing & availability” section—packing codes, quantities, hyperlinks—adds noise with no voltage value at all.  \n• Roughly one-third of the retained tokens are voltage related; the rest is extraneous, so the signal-to-noise ratio is mediocre.\n\nPRESERVING_INPUT_DATA: 29/34  \n• HTML hierarchy, table headers, and row associations are intact—good for a downstream parser.  \n• Units and conditions (e.g., “1000 @ IF=50 mA”) are preserved, keeping context.  \n• Minor formatting glitches (“tooltopTrigger” typo copied) but nothing that breaks structure.  \n• Because non-voltage columns remain, some analysts might consider the preservation excessive, yet fidelity to original layout is high.\n\nTOTAL SCORE: 77/100\n\nKEY STRENGTHS:\n- Captured both reverse and forward voltage specs with values and units.\n- Maintained original table and header structure, easing further parsing.\n- Preserved contextual cues (max/min labels, test conditions).\n\nKEY WEAKNESSES:  \n- Retained a lot of irrelevant specs (current, capacitance, ordering info), reducing efficiency.  \n- Voltage cells include embedded current conditions that may hinder clean numeric extraction.  \n- No attempt to highlight or isolate voltage fields; everything is left in raw form.\n\nVERDICT: Effective at keeping the required voltage information, but filtering needs to be tighter to remove non-voltage noise and improve downstream processing precision.",
      "success": true,
      "timestamp": "2025-07-10T16:40:20.598591"
    },
    {
      "run_id": 36,
      "strategy": "recall",
      "iteration": 9,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 36 | Iteration: 9\n\nRETAINING_TARGET_INFORMATION: 12/33  \n• The run captured only one concrete voltage figure: “Reverse voltage ≤ 100 V”.  \n• Forward-voltage (VF) data, breakdown voltage variants, clamping voltages, and any voltage tolerances that usually appear in the parametric tables are missing.  \n• The “V<sub>R</sub> [max] (V)” column is mentioned, but the numeric value is not reproduced.  \n• No other voltage-related rows (e.g., “V<sub>F</sub> @ I<sub>F</sub>”, “V<sub>RRM</sub>”, “V<sub>ESD</sub>”) are present.  \n→ Only a small subset of the expected voltage information was retained.\n\nELIMINATING_NON_RELEVANT: 20/33  \n• Most of the text is about voltage, but there is duplication (reverse-voltage line repeated twice).  \n• The “Environmental information” block is explicitly acknowledged even though it contains no voltage data—this is irrelevant noise.  \n• Introductory commentary (“These excerpts maintain…”) is meta-text and not part of the source data, reducing signal-to-noise.  \n• However, truly unrelated specs (current, power dissipation, package size) are largely absent.  \n→ Moderate success; some noise remains.\n\nPRESERVING_INPUT_DATA: 18/34  \n• Section headings (“Parametrics”, “Features and benefits”, etc.) are kept, helping context.  \n• Bullet formatting is fine, but original tables are compressed to single descriptive lines; numeric fidelity is lost.  \n• By omitting row/column structure, relationships between parameters are weakened.  \n• Minor editorial sentences were injected, slightly blurring the boundary between source and extract.\n\nTOTAL SCORE: 50/100\n\nKEY STRENGTHS:\n- Correctly identifies and labels sections where voltage is discussed.\n- Removes most unrelated specification categories (current, temperature, packaging).\n\nKEY WEAKNESSES:  \n- Misses all forward-voltage and several critical voltage ratings.\n- Duplicates the same reverse-voltage spec while omitting its numeric column entry.\n- Includes non-voltage “Environmental information” and explanatory meta-text.\n- Loses table structure, limiting downstream parsability.\n\nVERDICT: The filter captures only a fraction of the required voltage data and introduces some extraneous commentary, yielding a mediocre overall extraction quality.",
      "success": true,
      "timestamp": "2025-07-10T16:40:32.903364"
    },
    {
      "run_id": 37,
      "strategy": "liberal",
      "iteration": 10,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: liberal | Run: 37 | Iteration: 10\n\nRETAINING_TARGET_INFORMATION: 30/33  \n• Reverse-voltage data appears twice:  \n  – “Reverse voltage: V<sub>R</sub> ≤ 100 V” in the Features list.  \n  – “V<sub>R</sub> [max] (V) … 100” in the parametric table.  \n• Forward-voltage information is present once:  \n  – “V<sub>F</sub> [max] (mV) … 1000@IF=50 mA”.  \n• No other voltage-related fields exist on the source page, so nothing is missing.  \n• Context (max vs typ) and the association to the BAV99 line are preserved.  \n• Minor deduction because the “1000@IF=50 mA” string is kept verbatim; a cleaner filter could have removed the drive-current note while retaining the 1000 mV figure.\n\nELIMINATING_NON_RELEVANT: 15/33  \n• Large blocks of non-voltage information remain: download links, features about speed/capacitance, entire parametric columns for current, capacitance, t_rr, package, size, automotive flag, etc.  \n• Roughly one third of the retained tokens are voltage related, so the signal-to-noise ratio is mediocre.  \n• No obvious over-trimming, but the goal of a “filter” stage is to reduce noise more aggressively.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original HTML hierarchy (headers, lists, table rows) is intact, making downstream parsing easy.  \n• Row/column relationships inside the parametric table are preserved; voltage cells can still be matched to the correct part.  \n• Minor markdown artefacts (“---”) were inserted, but they do not break structure.  \n• No data corruption observed.\n\nTOTAL SCORE: 75/100\n\nKEY STRENGTHS:\n- All voltage specifications (VR and VF) captured with correct numerical values.\n- Table context preserved, enabling reliable mapping of voltage data to the BAV99 device.\n- Formatting largely maintained for straightforward downstream parsing.\n\nKEY WEAKNESSES:  \n- Considerable amount of non-voltage information left in the output (currents, package, download button, etc.).  \n- Forward-voltage cell still contains current condition text (“@IF=50 mA”) that a stricter filter might omit.  \n- Minor extra delimiter lines (“---”) add slight noise.\n\nVERDICT: Solid retention of desired voltage data, but liberal strategy leaves too much extraneous information, yielding only moderate overall filtering quality.",
      "success": true,
      "timestamp": "2025-07-10T16:40:45.738886"
    },
    {
      "run_id": 38,
      "strategy": "inclusive",
      "iteration": 10,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: inclusive | Run: 38 | Iteration: 10  \n\nRETAINING_TARGET_INFORMATION: 28/33  \nThe filter keeps the two key voltage items that are explicitly present in the source:  \n• Reverse voltage: “V₍R₎ ≤ 100 V” in list form and again in the table (V₍R₎ [max] = 100 V).  \n• Forward voltage: “V₍F₎ [max] = 1000 mV @ I₍F₎ = 50 mA”.  \n\nThose cover the primary reverse- and forward-voltage ratings. However, any other voltage-related rows that might have existed in the full page (e.g., surge reverse voltage, peak repetitive VRRM, breakdown voltage, test conditions for VF, or any min/typ values) are not shown. Because we cannot tell whether they were absent in the source or simply lost in filtering, we deduct modest points for potential omissions. Overall, the essential voltage specs are retained, but coverage is not demonstrably “all-inclusive.”\n\nELIMINATING_NON_RELEVANT: 26/33  \nMost of the kept lines are voltage-focused, but there is still noticeable noise:  \n• Current specification “I₍F₎ [max] = 215 mA” appears twice (once in its own row, once in the “Schematic” stub).  \n• A “Schematic” label with no voltage data.  \n• Several vestigial HTML tags (<tbody>, <tr>, <th>, etc.) that add no semantic value for voltage extraction.  \nStill, the signal-to-noise ratio is reasonable; the majority of visible numeric data are voltages.\n\nPRESERVING_INPUT_DATA: 27/34  \nThe fragment preserves original HTML row / cell layout sufficiently for a downstream parser to understand column context (“V₍R₎ [max] (V)” followed by 100). Forward-voltage context with its test current is intact as one string.  \nWeaknesses:  \n• Some table tags are unbalanced (e.g., nested <td><td>).  \n• Section separators (“---”) and triple back-ticks break continuity.  \n• The duplicated “I₍F₎ [max]” row right after “V₍R₎ [max]” may confuse hierarchy.  \nNonetheless, the relative placement of values and headings is mostly preserved.\n\nTOTAL SCORE: 81/100  \n\nKEY STRENGTHS:  \n- Captures both reverse and forward voltage values with their units.  \n- Maintains header/value pairing, aiding later parsing.  \n- Limited amount of non-voltage numeric clutter.\n\nKEY WEAKNESSES:  \n- Possible loss of other voltage parameters not visible here (e.g., surge ratings).  \n- Includes current specs and miscellaneous HTML debris.  \n- Minor structural corruption (duplicated/unfinished tags, markdown separators).\n\nVERDICT: A generally effective voltage-focused filter with good retention and acceptable noise, but not fully comprehensive nor perfectly clean.",
      "success": true,
      "timestamp": "2025-07-10T16:41:01.618849"
    },
    {
      "run_id": 39,
      "strategy": "contextual",
      "iteration": 10,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: contextual | Run: 39 | Iteration: 10\n\nRETAINING_TARGET_INFORMATION: 30/33  \n• Reverse-voltage data are captured twice – the narrative bullet “Reverse voltage: V₍R₎ ≤ 100 V” and the parametric-table column “V₍R₎ [max] (V) = 100”.  \n• Forward-voltage data “V₍F₎ [max] (mV) = 1000 @ IF = 50 mA” are present.  \n• Voltage appears nowhere else on the original page, so the filter did not miss any additional voltage fields.  \n• Context (e.g., “@ IF = 50 mA”) is preserved.  \nMinor shortcoming: The “Maximum repetitive reverse voltage” or “Breakdown voltage” headline (if it existed) is not distinguished from generic VR, but that is a labeling nuance rather than lost data.\n\nELIMINATING_NON_RELEVANT: 16/33  \n• In addition to voltage, the filter kept many non-voltage columns (IFSM, IR, IFRM, t_rr, C_d, package size, automotive flag).  \n• Whole sections on Package, Environmental information, soldering documents, 3-D images, RoHS icons, etc., remain—none of which help a voltage-only extractor.  \n• Roughly 70 % of the retained tokens are non-voltage noise, so the signal-to-noise ratio is mediocre.  \n• No blatant off-topic text (marketing, unrelated products), but the filter clearly erred on the side of over-retention.\n\nPRESERVING_INPUT_DATA: 30/34  \n• Original section headers (Features, Parametrics, Package, Environmental) are intact, as are HTML tables and column labels—useful for downstream parsing.  \n• Mark-up nesting is preserved; relationships between voltage values and their part numbers stay clear.  \n• Minor issues: some empty cells and repeated columns (Package version / name) could have been collapsed, but overall coherence is very good.\n\nTOTAL SCORE: 76/100\n\nKEY STRENGTHS:\n- Captured every voltage specification present (VR and VF with limits and conditions).\n- Maintained full tabular context, easing precise extraction in the next phase.\n- Clean, coherent structure identical to source.\n\nKEY WEAKNESSES:  \n- Retained large amounts of non-voltage technical and logistic data, lowering efficiency.  \n- No additional filtering of package, environmental, or current-related specs.  \n- Slight redundancy in duplicated columns; could risk confusing simplistic parsers.\n\nVERDICT: Accurate but overly permissive filter—excellent voltage retention, yet needs tighter noise reduction to reach an optimal extraction signal.",
      "success": true,
      "timestamp": "2025-07-10T16:41:17.309949"
    },
    {
      "run_id": 40,
      "strategy": "recall",
      "iteration": 10,
      "analysis": "EXPERIMENT ANALYSIS - Strategy: recall | Run: 40 | Iteration: 10\n\nRETAINING_TARGET_INFORMATION: 14/33  \nThe filter surfaced only one voltage-related datum – the reverse voltage (V_R ≤ 100 V) – and repeated it three times (Features, Parametrics, Ordering).  \n• Forward voltage (V_F) is entirely absent.  \n• No other voltage ratings (peak reverse repetitive, avalanche, surge, etc.) are present.  \n• Parametric table data are limited to a single column entry; any min/typ values, test conditions or temperature deratings are missing.  \nBecause roughly half of the essential voltage information outlined in the expected set is missing, a substantial penalty is applied.\n\nELIMINATING_NON_RELEVANT: 18/33  \nRoughly half of the retained text is not about voltage:  \n• Switching speed (t_rr), capacitance (C_d) and leakage current lines.  \n• Packaging, SMD size, ordering codes, RoHS and chemical content sections.  \nThese dilute the signal. Still, the overall excerpt is short (≈220 tokens), so noise is limited in absolute terms. The signal-to-noise ratio is mediocre rather than poor.\n\nPRESERVING_INPUT_DATA: 28/34  \n• Section headings and bullet structure closely mirror the original document; V_R values stay in their tables/bullets, maintaining context.  \n• Markdown and subscripts (V_R) are preserved, aiding downstream parsing.  \n• However, by omitting whole voltage rows, the relational integrity of the full parametric table is partially lost. Minor markdown artefacts (back-ticks absent around formulas) but nothing serious.\n\nTOTAL SCORE: 60/100\n\nKEY STRENGTHS:\n- Reverse voltage captured consistently in three contexts.\n- Original formatting and hierarchy largely intact, helpful for parsers.\n- Output is concise (low token cost).\n\nKEY WEAKNESSES:  \n- Forward voltage and other critical voltage ratings missing.  \n- Considerable non-voltage information retained, lowering precision.  \n- Limited breadth of parametric data; only one voltage field extracted.\n\nVERDICT: Adequate structure retention but the filter sacrifices completeness and precision, yielding only a partial, moderately noisy set of voltage specifications.",
      "success": true,
      "timestamp": "2025-07-10T16:41:34.201959"
    }
  ]
}